#+OPTIONS: num:nil toc:nil timestamp:nil
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_THEME: dracula
#+REVEAL_TRANS: slide
#+REVEAL_EXTRA_CSS: https://use.fontawesome.com/releases/v5.15.4/css/all.css
#+REVEAL_INIT_OPTIONS: width:1200, height:900, margin: 0.1, minScale:0.2, maxScale:1.2

#+TITLE: Tutorial: Presentaciones Reveal.js desde Emacs
#+AUTHOR: Lenin G. Falconí
#+DATE: Periodo 2026-A
#+LANGUAGE: es

** @@html:<i class="fas fa-terminal"></i>@@ Bloques de código
Los bloques ~#+begin_src~ de Org-mode se exportan con resaltado de sintaxis:

#+begin_src python :results output :exports both
import numpy as np

def greet(name):
    """Saluda cordialmente."""
    return f"Hola, {name}!"

print(greet("Arquitectura de Computadores"))
#+end_src

#+RESULTS:
: Hola, Arquitectura de Computadores!

*Salida:*
#+begin_example
Hola, Arquitectura de Computadores!
#+end_example

